$(function() {

	// var data = {
	//     resource_id: '3d38a652-adbc-442b-9760-50d30a6db6c4', // the resource id
	//     limit: 15 // get 15 results
	//   };
	//   $.ajax({
	//     url: 'http://data.obshtestvo.bg/api/action/datastore_search',
	//     data: data,
	//     dataType: 'jsonp',
	//     success: function(data) {
	//       alert('Total results found: ' + data.result.total)
	//     },
	//     error: function(data,text) {
	//     	alert(JSON.stringify(data));
	//     	alert(text);
	//     }
	//   });

	var mapOptions = {
          center: { lat: 42.637626, lng: 23.322284},
          zoom: 12
        };
    var map = new google.maps.Map(document.getElementById('map-canvas'),mapOptions);

	var dataset = [{"Име на фирма": "", "Седалище": "", "Дейности": "", "Адрес на аптека - град": "гр. София", "Адрес на аптека": "ж.к. Слатина, бл. 18", "Дата": "1995-04-09T00:00:00", "№/№ промяна": "39-НА", "Адрес на управление": "", "Ръководител": "Ариадна Генадиева Вакъвчиева", "пом.-фарм.": "", "_id": 1}, {"Име на фирма": "", "Седалище": "", "Дейности": "", "Адрес на аптека - град": "гр. София", "Адрес на аптека": "кв. Симеоново, ул. Крайречна 10", "Дата": "1995-09-27T00:00:00", "№/№ промяна": "63-НА", "Адрес на управление": "", "Ръководител": "Гергана Асенова Влаина - Абдала", "пом.-фарм.": "", "_id": 3}, {"Име на фирма": "", "Седалище": "", "Дейности": "", "Адрес на аптека - град": "гр. София", "Адрес на аптека": "ул. Георг Вашингтон 53", "Дата": "1995-11-17T00:00:00", "№/№ промяна": "114-НА", "Адрес на управление": "", "Ръководител": "Красимира Асенова Божилова", "пом.-фарм.": "", "_id": 8}, {"Име на фирма": "", "Седалище": "", "Дейности": "", "Адрес на аптека - град": "гр. София", "Адрес на аптека": "ул. Гоце Делчев, бл. 1, вх. Б", "Дата": "1995-12-29T00:00:00", "№/№ промяна": "129-НА", "Адрес на управление": "", "Ръководител": "Стефанка Тодорова Петрова", "пом.-фарм.": "", "_id": 9}, {"Име на фирма": "", "Седалище": "", "Дейности": "", "Адрес на аптека - град": "гр. София", "Адрес на аптека": "кв. Драгалевци, ул. Крайречна 2", "Дата": "1996-02-29T00:00:00", "№/№ промяна": "217-НА", "Адрес на управление": "", "Ръководител": "Цветан Иванов Диков", "пом.-фарм.": "", "_id": 11}, {"Име на фирма": "", "Седалище": "", "Дейности": "", "Адрес на аптека - град": "гр. София", "Адрес на аптека": "бул. Никола Петков 56", "Дата": "1996-05-17T00:00:00", "№/№ промяна": "263-НА", "Адрес на управление": "", "Ръководител": "Републикански център по протезиранеn и възстановителна хирургияn ръководител Йорданка Стефанова Бозарова", "пом.-фарм.": "", "_id": 15},{  
            "Име на фирма":"",
            "Седалище":"",
            "Дейности":"",
            "Адрес на аптека - град":"гр. София",
            "Адрес на аптека":"бул. Столетов 98",
            "Дата":"1996-07-22T00:00:00",
            "№/№ промяна":"409-НА",
            "Адрес на управление":"",
            "Ръководител":"Любка Петрова Георгиева",
            "пом.-фарм.":"",
            "_id":32
         },
         {  
            "Име на фирма":"",
            "Седалище":"",
            "Дейности":"",
            "Адрес на аптека - град":"гр. София",
            "Адрес на аптека":"ул. Вихрен 39-А, вх. А",
            "Дата":"1996-09-20T00:00:00",
            "№/№ промяна":"453-НА",
            "Адрес на управление":"",
            "Ръководител":"Марийка Любенова Тошева",
            "пом.-фарм.":"",
            "_id":33
         },
         {  
            "Име на фирма":"",
            "Седалище":"",
            "Дейности":"",
            "Адрес на аптека - град":"гр. София",
            "Адрес на аптека":"ул. Димчо Дебелянов 16",
            "Дата":"1996-10-28T00:00:00",
            "№/№ промяна":"499-НА",
            "Адрес на управление":"",
            "Ръководител":"Цеца Георгиева Медарова",
            "пом.-фарм.":"",
            "_id":35
         },
         {  
            "Име на фирма":"",
            "Седалище":"",
            "Дейности":"",
            "Адрес на аптека - град":"гр. София",
            "Адрес на аптека":"бул. Черни връх 46",
            "Дата":"1996-10-28T00:00:00",
            "№/№ промяна":"514-НА",
            "Адрес на управление":"",
            "Ръководител":"Санда Иванова Симеонова",
            "пом.-фарм.":"",
            "_id":36
         }];

	var addresses = $.map(dataset, function(item) {
		return item["Адрес на аптека"];
	});

	var geocoder = new google.maps.Geocoder();

	$.each(addresses,function(idx,address) {
		geocoder.geocode({
			'address': "София, " + address,
			'region': 'BG'
		}, function(results, status) {
			if (status == google.maps.GeocoderStatus.OK) {
				var marker = new google.maps.Marker({
		            map: map,
		            position: results[0].geometry.location,
		            title: address
		        });
			} else {
				//alert("Geocode was not successful for the following reason: " + status);
			}
		});
	});
});